{
  "irVersion": "1.0",
  "generatedAt": "2025-12-10T18:00:11.672774Z",
  "job": {
    "id": "job-J_DEMO_001-202512102330",
    "name": "J_DEMO_001"
  },
  "nodes": [
    {
      "id": "n0",
      "type": "Source",
      "subtype": "File",
      "name": "Input_File",
      "props": {
        "path": "D:\\ETL_Migrator\\inputfile.csv",
        "delimiter": ",",
        "firstLineColumnNames": true,
        "row_separator": "\\n",
        "header_lines": "1",
        "footer_lines": "0",
        "row_limit": "",
        "remove_empty_row": true,
        "die_on_error": false
      },
      "transformationDetails": {
        "hasTransformations": false,
        "transformationType": "none",
        "complexityScore": 0.0,
        "transformationCount": 0
      },
      "schemaRef": "s_V0S0",
      "provenance": {
        "source": "dsx",
        "location": "original.dsx"
      }
    },
    {
      "id": "n1",
      "type": "Transform",
      "subtype": "Map",
      "name": "User_Transformer",
      "props": {},
      "transformationDetails": {
        "hasTransformations": true,
        "transformationType": "mixed",
        "complexityScore": 0.0,
        "transformationCount": 4
      },
      "schemaRef": "s_V0S1",
      "provenance": {
        "source": "dsx",
        "location": "original.dsx"
      }
    },
    {
      "id": "n2",
      "type": "Sink",
      "subtype": "File",
      "name": "Output_File",
      "props": {
        "path": "D:\\ETL_Migrator\\outputfile.csv",
        "delimiter": ",",
        "firstLineColumnNames": true,
        "row_separator": "\\n",
        "include_header": true,
        "append": false,
        "compress": false,
        "advanced_separator": false,
        "custom_test_property": "test_value_123"
      },
      "transformationDetails": {
        "hasTransformations": false,
        "transformationType": "none",
        "complexityScore": 0.0,
        "transformationCount": 0
      },
      "schemaRef": "s_V0S2",
      "provenance": {
        "source": "dsx",
        "location": "original.dsx"
      }
    }
  ],
  "links": [
    {
      "id": "l1",
      "from": {
        "nodeId": "n0",
        "port": "out"
      },
      "to": {
        "nodeId": "n1",
        "port": "in"
      },
      "schemaRef": "s_V0S0"
    },
    {
      "id": "l2",
      "from": {
        "nodeId": "n1",
        "port": "out"
      },
      "to": {
        "nodeId": "n0",
        "port": "in"
      },
      "schemaRef": "s_V0S1"
    },
    {
      "id": "l3",
      "from": {
        "nodeId": "n1",
        "port": "out"
      },
      "to": {
        "nodeId": "n2",
        "port": "in"
      },
      "schemaRef": "s_V0S1"
    }
  ],
  "schemas": {
    "s_V0S0": [],
    "s_V0S1": [
      {
        "name": "USERID",
        "type": "decimal",
        "nullable": true,
        "hasTransformation": true,
        "sourceColumns": [
          "UserLink",
          "UserLink.USERID",
          "USERID"
        ],
        "functions": [],
        "expression": "UserLink.USERID",
        "transformationLogic": {
          "type": "simple_column",
          "source_columns": [
            "UserLink",
            "UserLink.USERID",
            "USERID"
          ],
          "functions": [],
          "expression": "UserLink.USERID"
        },
        "transformationClassification": "simple_column"
      },
      {
        "name": "USERNAME",
        "type": "varchar",
        "nullable": true,
        "hasTransformation": true,
        "sourceColumns": [
          "USERNAME"
        ],
        "functions": [
          "UpperCase"
        ],
        "expression": "UpperCase(USERNAME)",
        "transformationLogic": {
          "type": "simple",
          "source_columns": [
            "USERNAME"
          ],
          "functions": [
            "UpperCase"
          ],
          "expression": "UpperCase(USERNAME)"
        },
        "transformationClassification": "simple"
      },
      {
        "name": "EMAIL",
        "type": "varchar",
        "nullable": true,
        "hasTransformation": true,
        "sourceColumns": [
          "UserLink.EMAIL",
          "UserLink",
          "EMAIL"
        ],
        "functions": [],
        "expression": "UserLink.EMAIL",
        "transformationLogic": {
          "type": "simple_column",
          "source_columns": [
            "UserLink.EMAIL",
            "UserLink",
            "EMAIL"
          ],
          "functions": [],
          "expression": "UserLink.EMAIL"
        },
        "transformationClassification": "simple_column"
      },
      {
        "name": "STATUS",
        "type": "varchar",
        "nullable": true,
        "hasTransformation": true,
        "sourceColumns": [
          "UserLink.STATUS",
          "UserLink",
          "STATUS"
        ],
        "functions": [],
        "expression": "UserLink.STATUS",
        "transformationLogic": {
          "type": "simple_column",
          "source_columns": [
            "UserLink.STATUS",
            "UserLink",
            "STATUS"
          ],
          "functions": [],
          "expression": "UserLink.STATUS"
        },
        "transformationClassification": "simple_column"
      }
    ],
    "s_V0S2": []
  },
  "transformationTracking": {
    "totalTransformations": 4,
    "transformationTypes": {},
    "complexityDistribution": {}
  }
}