{
  "irVersion": "1.0",
  "generatedAt": "2025-12-10T17:39:13.123421Z",
  "job": {
    "id": "job-J_DEMO_001-202512101739",
    "name": "J_DEMO_001"
  },
  "nodes": [
    {
      "id": "n0",
      "type": "Source",
      "subtype": "File",
      "name": "Input_File",
      "props": {
        "path": "D:/ETL_Migrator/inputfile.csv",
        "delimiter": ",",
        "encoding": "UTF-8",
        "firstLineColumnNames": true
      },
      "transformationDetails": {
        "hasTransformations": false,
        "transformationType": "none",
        "complexityScore": 0.0,
        "transformationCount": 0
      },
      "schemaRef": "s_V0S0",
      "provenance": {
        "source": "dsx",
        "location": "J_DEMO_001.dsx",
        "lineStart": "--",
        "lineEnd": "--",
        "filePath": "J_DEMO_001.dsx"
      }
    },
    {
      "id": "n1",
      "type": "Transform",
      "subtype": "Map",
      "name": "User_Transformer",
      "props": {},
      "transformationDetails": {
        "hasTransformations": true,
        "transformationType": "mixed",
        "complexityScore": 0.0,
        "transformationCount": 4
      },
      "schemaRef": "s_V0S1",
      "trxgenCode": "Value =+=+=+=",
      "trxClassName": "V0S1_SIMPLE_USER_PROCESS_User_Transformer",
      "jobParameterNames": "ENVIRONMENT",
      "provenance": {
        "source": "dsx",
        "location": "J_DEMO_001.dsx",
        "lineStart": "--",
        "lineEnd": "--",
        "filePath": "J_DEMO_001.dsx"
      }
    },
    {
      "id": "n2",
      "type": "Sink",
      "subtype": "File",
      "name": "Output_File",
      "props": {
        "path": "D:/ETL_Migrator/outputfile.csv",
        "delimiter": ",",
        "encoding": "UTF-8",
        "firstLineColumnNames": true
      },
      "transformationDetails": {
        "hasTransformations": false,
        "transformationType": "none",
        "complexityScore": 0.0,
        "transformationCount": 0
      },
      "schemaRef": "s_V0S2",
      "provenance": {
        "source": "dsx",
        "location": "J_DEMO_001.dsx",
        "lineStart": "--",
        "lineEnd": "--",
        "filePath": "J_DEMO_001.dsx"
      }
    }
  ],
  "links": [
    {
      "id": "l1",
      "from": {
        "nodeId": "n0",
        "port": "out"
      },
      "to": {
        "nodeId": "n1",
        "port": "in"
      },
      "schemaRef": "s_V0S0"
    },
    {
      "id": "l2",
      "from": {
        "nodeId": "n1",
        "port": "out"
      },
      "to": {
        "nodeId": "n0",
        "port": "in"
      },
      "schemaRef": "s_V0S1"
    },
    {
      "id": "l3",
      "from": {
        "nodeId": "n1",
        "port": "out"
      },
      "to": {
        "nodeId": "n2",
        "port": "in"
      },
      "schemaRef": "s_V0S1"
    }
  ],
  "schemas": {
    "s_V0S0": [],
    "s_V0S1": [
      {
        "name": "USERID",
        "type": "decimal",
        "nullable": true,
        "transformationLogic": {
          "type": "simple_column",
          "source_columns": [
            "UserLink",
            "UserLink.USERID",
            "USERID"
          ],
          "functions": [],
          "expression": "UserLink.USERID"
        },
        "transformationClassification": "simple_column",
        "complexityScore": 0.0,
        "sourceColumns": [
          "UserLink",
          "UserLink.USERID",
          "USERID"
        ],
        "expression": "UserLink.USERID",
        "functions": [],
        "hasTransformation": true
      },
      {
        "name": "USERNAME",
        "type": "string",
        "nullable": true,
        "transformationLogic": {
          "type": "simple",
          "source_columns": [
            "USERNAME"
          ],
          "functions": [
            "UpperCase"
          ],
          "expression": "UpperCase(USERNAME)"
        },
        "transformationClassification": "simple",
        "complexityScore": 0.0,
        "sourceColumns": [
          "USERNAME"
        ],
        "expression": "UpperCase(USERNAME)",
        "functions": [
          "UpperCase"
        ],
        "hasTransformation": true
      },
      {
        "name": "EMAIL",
        "type": "string",
        "nullable": true,
        "transformationLogic": {
          "type": "simple_column",
          "source_columns": [
            "UserLink",
            "UserLink.EMAIL",
            "EMAIL"
          ],
          "functions": [],
          "expression": "UserLink.EMAIL"
        },
        "transformationClassification": "simple_column",
        "complexityScore": 0.0,
        "sourceColumns": [
          "UserLink",
          "UserLink.EMAIL",
          "EMAIL"
        ],
        "expression": "UserLink.EMAIL",
        "functions": [],
        "hasTransformation": true
      },
      {
        "name": "STATUS",
        "type": "string",
        "nullable": true,
        "transformationLogic": {
          "type": "simple_column",
          "source_columns": [
            "UserLink",
            "UserLink.STATUS",
            "STATUS"
          ],
          "functions": [],
          "expression": "UserLink.STATUS"
        },
        "transformationClassification": "simple_column",
        "complexityScore": 0.0,
        "sourceColumns": [
          "UserLink",
          "UserLink.STATUS",
          "STATUS"
        ],
        "expression": "UserLink.STATUS",
        "functions": [],
        "hasTransformation": true
      }
    ],
    "s_V0S2": []
  },
  "transformationTracking": {
    "totalTransformations": 3,
    "transformationTypes": {
      "simple_columns": 3,
      "aggregations": 0,
      "conditionals": 0,
      "expressions": 0,
      "constants": 0
    },
    "complexityDistribution": {
      "simple": 3,
      "aggregations": 0,
      "complex": 0
    }
  }
}